OdGiCommonDraw.displayModelerSilhouettes
\details
Checks whether silhouette curves should be generated (basically should return OdDbDatabase::getDISPSILH,
but the behavior could be specialized).
\returns
true if silhouette curves should be generated, false otherwise.

OdGiCommonDraw.currentGiPath
\details
Retrieves the current drawable nesting graph.
\returns
current drawable nesting graph.

OdGiCommonDraw.context
\details
Retrieves context associated with this object.
\returns
Pointer to the associated context.

OdGiCommonDraw.numberOfIsolines
\details
Retrieves the number of isolines to be drawn on surfaces during this vectorization.
\returns
number of isolines.
\remarks
Isolines are lines or curves which are used to represent the entity.
For example, if an entity is a sphere and this method returns 3, the
sphere should be displayed as 3 circles with a common center and planes that are
perpendicular to each other.

OdGiCommonDraw.deviation(OdGiDeviationType!System.Runtime.CompilerServices.IsConst,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the recommended maximum deviation of the
current vectorization for the specified point on a curve.
\param deviationType [in]  Deviation type.
\param pointOnCurve [in]  Point on a curve.
\returns
recommended maximum difference (with respect to the current active viewport) between the actual curve or surface,
and the tessellated curve or surface.
\remarks
deviationType must be one of the following:
Name                       Value
kOdGiMaxDevForCircle       0
kOdGiMaxDevForCurve        1
kOdGiMaxDevForBoundary     2
kOdGiMaxDevForIsoline      3
kOdGiMaxDevForFacet        4
\remarks
This method uses circle zoom percent as appropriate.

OdGiCommonDraw.isDragging
\details
Checks whether this vectorization process is the result of a "drag" operation.
\returns
true if this vectorization process is the result of a "drag" operation, false otherwise.

OdGiCommonDraw.rawGeometry
\details
Provides access to this object's "drawing interface."
\remarks
The "drawing interface" is a set of geometry functions used during the vectorization process.

OdGiCommonDraw.subEntityTraits
\details
Provides access to this object's subentity traits.
\returns
sub-entity traits.
\remarks
This allows the modification of the vectorization attributes such as color, linetype, etc.

OdGiCommonDraw.regenAbort
\details
Checks whether this vectorization process should be aborted.
\returns
true if this vectorization process should be aborted.

OdGiCommonDraw.regenType
\details
Retrieves the regeneration type of the current vectorization process.
\returns
one of the following regeneration types:
Name                            Value
eOdGiRegenTypeInvalid           0
kOdGiStandardDisplay            2
kOdGiHideOrShadeCommand         3
kOdGiRenderCommand              4
kOdGiForExplode                 5
kOdGiSaveWorldDrawForProxy      6
kOdGiForExtents                 7